In [1]:
!pip3 install -r requirements.txt

Requirement already satisfied: pandas in /usr/local/lib/python3.10/site-packages (from -r requirements.txt (line 1)) (1.5.2)
Requirement already satisfied: plotly in /usr/local/lib/python3.10/site-packages (from -r requirements.txt (line 2)) (5.11.0)
Requirement already satisfied: rpy2==3.5.1 in /usr/local/lib/python3.10/site-packages (from -r requirements.txt (line 3)) (3.5.1)
Requirement already satisfied: pyreadr in /usr/local/lib/python3.10/site-packages (from -r requirements.txt (line 4)) (0.4.7)
Requirement already satisfied: nbformat>=4.2.0 in /usr/local/lib/python3.10/site-packages (from -r requirements.txt (line 5)) (5.7.0)
Requirement already satisfied: jinja2 in /usr/local/lib/python3.10/site-packages (from rpy2==3.5.1->-r requirements.txt (line 3)) (3.1.2)
Requirement already satisfied: cffi>=1.10.0 in /usr/local/lib/python3.10/site-packages (from rpy2==3.5.1->-r requirements.txt (line 3)) (1.15.1)
Requirement already satisfied: tzlocal in /usr/local/lib/python3.10/site-packages (from rpy2==3.5.1->-r requirements.txt (line 3)) (4.2)
Requirement already satisfied: pytz in /usr/local/lib/python3.10/site-packages (from rpy2==3.5.1->-r requirements.txt (line 3)) (2022.6)
Requirement already satisfied: python-dateutil>=2.8.1 in /usr/local/lib/python3.10/site-packages (from pandas->-r requirements.txt (line 1)) (2.8.2)
Requirement already satisfied: numpy>=1.21.0 in /usr/local/lib/python3.10/site-packages (from pandas->-r requirements.txt (line 1)) (1.23.4)
Requirement already satisfied: tenacity>=6.2.0 in /usr/local/lib/python3.10/site-packages (from plotly->-r requirements.txt (line 2)) (8.1.0)
Requirement already satisfied: jupyter-core in /usr/local/lib/python3.10/site-packages (from nbformat>=4.2.0->-r requirements.txt (line 5)) (5.1.0)
Requirement already satisfied: jsonschema>=2.6 in /usr/local/lib/python3.10/site-packages (from nbformat>=4.2.0->-r requirements.txt (line 5)) (4.17.3)
Requirement already satisfied: traitlets>=5.1 in /usr/local/lib/python3.10/site-packages (from nbformat>=4.2.0->-r requirements.txt (line 5)) (5.7.1)
Requirement already satisfied: fastjsonschema in /usr/local/lib/python3.10/site-packages (from nbformat>=4.2.0->-r requirements.txt (line 5)) (2.16.2)
Requirement already satisfied: pycparser in /usr/local/lib/python3.10/site-packages (from cffi>=1.10.0->rpy2==3.5.1->-r requirements.txt (line 3)) (2.21)
Requirement already satisfied: pyrsistent!=0.17.0,!=0.17.1,!=0.17.2,>=0.14.0 in /usr/local/lib/python3.10/site-packages (from jsonschema>=2.6->nbformat>=4.2.0->-r requirements.txt (line 5)) (0.19.2)
Requirement already satisfied: attrs>=17.4.0 in /usr/local/lib/python3.10/site-packages (from jsonschema>=2.6->nbformat>=4.2.0->-r requirements.txt (line 5)) (22.1.0)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas->-r requirements.txt (line 1)) (1.16.0)
Requirement already satisfied: MarkupSafe>=2.0 in /usr/local/lib/python3.10/site-packages (from jinja2->rpy2==3.5.1->-r requirements.txt (line 3)) (2.1.1)
Requirement already satisfied: platformdirs>=2.5 in /usr/local/lib/python3.10/site-packages (from jupyter-core->nbformat>=4.2.0->-r requirements.txt (line 5)) (2.6.0)
Requirement already satisfied: pytz-deprecation-shim in /usr/local/lib/python3.10/site-packages (from tzlocal->rpy2==3.5.1->-r requirements.txt (line 3)) (0.1.0.post0)
Requirement already satisfied: tzdata in /usr/local/lib/python3.10/site-packages (from pytz-deprecation-shim->tzlocal->rpy2==3.5.1->-r requirements.txt (line 3)) (2022.7)

[notice] A new release of pip available: 22.2.2 -> 22.3.1
[notice] To update, run: python3.10 -m pip install --upgrade pip

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('data/airquality.csv')

# Task 1
Question 1. What are the column names of the data frame?

In [4]:
list(df.columns)

['Ozone', 'Solar.R', 'Wind', 'Temp', 'Month', 'Day']

Question 2. What are the row names of the data frame?

In [5]:
df.index.values

array([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,
        13,  14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,
        26,  27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,
        39,  40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,
        52,  53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,
        65,  66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,
        78,  79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,
        91,  92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103,
       104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116,
       117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129,
       130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142,
       143, 144, 145, 146, 147, 148, 149, 150, 151, 152])

Question 3. Extract the first 6 rows of the data frame and print them to the console

In [43]:
df.head(6)

   Ozone  Solar.R  Wind  Temp  Month  Day
0   41.0    190.0   7.4    67      5    1
1   36.0    118.0   8.0    72      5    2
2   12.0    149.0  12.6    74      5    3
3   18.0    313.0  11.5    62      5    4
4    NaN      NaN  14.3    56      5    5
5   28.0      NaN  14.9    66      5    6

Question 4. How many observations (i.e. rows) are in this data frame?

In [11]:
len(df.index)

153

Question 5. Extract the last 6 rows of the data frame and print them to the 
console

In [12]:
df.tail(6)

     Ozone  Solar.R  Wind  Temp  Month  Day
147   14.0     20.0  16.6    63      9   25
148   30.0    193.0   6.9    70      9   26
149    NaN    145.0  13.2    77      9   27
150   14.0    191.0  14.3    75      9   28
151   18.0    131.0   8.0    76      9   29
152   20.0    223.0  11.5    68      9   30

Question 6. How many missing values are in the “Ozone” column of this data frame?

In [6]:
df.Ozone.isna().sum()

37

Question 7. What is the mean of the “Ozone” column in this dataset? Exclude missing
values (coded as NA) from this calculation.

In [7]:
df.Ozone.mean(skipna=True)

42.12931034482759

Question 8. Extract the subset of rows of the data frame where Ozone values are above 31
and Temp values are above 90.

In [26]:
df.query('Ozone > 31 & Temp > 90')

     Ozone  Solar.R  Wind  Temp  Month  Day
68    97.0    267.0   6.3    92      7    8
69    97.0    272.0   5.7    92      7    9
119   76.0    203.0   9.7    97      8   28
120  118.0    225.0   2.3    94      8   29
121   84.0    237.0   6.3    96      8   30
122   85.0    188.0   6.3    94      8   31
123   96.0    167.0   6.9    91      9    1
124   78.0    197.0   5.1    92      9    2
125   73.0    183.0   2.8    93      9    3
126   91.0    189.0   4.6    93      9    4

Question 9. Use a for loop to create a vector of length 6 containing the mean of each column
in the data frame (excluding all missing values).

In [28]:
res = [df[column].mean(skipna=True) for column in list(df.columns)]

res

[42.12931034482759,
 185.93150684931507,
 9.957516339869281,
 77.88235294117646,
 6.993464052287582,
 15.803921568627452]

Question 10. Use the apply function to calculate the standard deviation of each column in
the data frame (excluding all missing values).

In [29]:
res = [df[column].std(skipna=True) for column in list(df.columns)]

res

[32.98788451443395,
 90.05842222838167,
 3.5230013522125962,
 9.465269740971456,
 1.4165224840123147,
 8.864520368425419]

Question 11. Calculate the mean of “Ozone” for each Month in the data frame and create a
vector containing the monthly means (exclude all missing values).

In [37]:
df.groupby(by=["Month"], dropna=True)['Ozone'].mean()

Month
5    23.615385
6    29.444444
7    59.115385
8    59.961538
9    31.448276
Name: Ozone, dtype: float64

Question 12. Draw a random sample of 5 rows from the data frame

In [38]:
df.sample(5)

     Ozone  Solar.R  Wind  Temp  Month  Day
135   28.0    238.0   6.3    77      9   13
113    9.0     36.0  14.3    72      8   22
121   84.0    237.0   6.3    96      8   30
29   115.0    223.0   5.7    79      5   30
73    27.0    175.0  14.9    81      7   13